# Business KPI Analysis of Walmart Sales Using SQL

In [2]:
#import libraries
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('..\db\walmart.db')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\david\AppData\Local\Temp\ipykernel_36112\3339318204.py:1: SyntaxWarning: invalid escape sequence '\d'
  conn = sqlite3.connect('..\db\walmart.db')

In [4]:
pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type ='table';",
    conn
)

            name
0  walmart_sales

In [5]:
pd.read_sql(
    "SELECT * FROM walmart_sales LIMIT 5",
    conn
)

,Store,Dept,Date,Weekly_Sales,IsHoliday,Type,Size,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment
0,1,1,2010-02-05 00:00:00,24924.50,0,A,151315,42.31,2.572,None,None,None,None,None,211.096358,8.106
1,1,1,2010-02-12 00:00:00,46039.49,1,A,151315,38.51,2.548,None,None,None,None,None,211.242170,8.106
2,1,1,2010-02-19 00:00:00,41595.55,0,A,151315,39.93,2.514,None,None,None,None,None,211.289143,8.106
3,1,1,2010-02-26 00:00:00,19403.54,0,A,151315,46.63,2.561,None,None,None,None,None,211.319643,8.106
4,1,1,2010-03-05 00:00:00,21827.90,0,A,151315,46.50,2.625,None,None,None,None,None,211.350143,8.106

In [14]:
pd.read_sql(
    """Select Store, ROUND(SUM(Weekly_Sales)/1000000,2) as Total_Sales_Millions FROM walmart_sales 
    GROUP BY STORE
    ORDER BY Total_Sales_Millions DESC
    LIMIT 10""",
    conn
)

   Store  Total_Sales_Millions
0     20                301.40
1      4                299.54
2     14                289.00
3     13                286.52
4      2                275.38
5     10                271.62
6     27                253.86
7      6                223.76
8      1                222.40
9     39                207.45